{"class_name": "Model", "keras_version": "2.1.5", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 15, 15, 4], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 15, 15, 4], "name": "input_2", "sparse": false}, "name": "input_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResCnn.headConv2D", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "ResCnn.headConv2D"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["ResCnn.headConv2D", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResCnn.BnHead", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "ResCnn.BnHead"}, {"class_name": "Activation", "inbound_nodes": [[["ResCnn.BnHead", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "name": "activation_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResCnn.layer_1_cv_a", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "ResCnn.layer_1_cv_a"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["ResCnn.layer_1_cv_a", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResCnn.layer_1_bn_a", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "ResCnn.layer_1_bn_a"}, {"class_name": "Activation", "inbound_nodes": [[["ResCnn.layer_1_bn_a", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "name": "activation_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResCnn.layer_1_cv_b", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "ResCnn.layer_1_cv_b"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["ResCnn.layer_1_cv_b", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResCnn.layer_1_bn_b", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "ResCnn.layer_1_bn_b"}, {"class_name": "Activation", "inbound_nodes": [[["ResCnn.layer_1_bn_b", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "name": "activation_3"}, {"class_name": "Add", "inbound_nodes": [[["activation_3", 0, 0, {}], ["activation_1", 0, 0, {}]]], "config": {"trainable": true, "name": "add_1"}, "name": "add_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResCnn.layer_2_cv_a", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "ResCnn.layer_2_cv_a"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["ResCnn.layer_2_cv_a", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResCnn.layer_2_bn_a", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "ResCnn.layer_2_bn_a"}, {"class_name": "Activation", "inbound_nodes": [[["ResCnn.layer_2_bn_a", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "name": "activation_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResCnn.layer_2_cv_b", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "ResCnn.layer_2_cv_b"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["ResCnn.layer_2_cv_b", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResCnn.layer_2_bn_b", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "ResCnn.layer_2_bn_b"}, {"class_name": "Activation", "inbound_nodes": [[["ResCnn.layer_2_bn_b", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "name": "activation_5"}, {"class_name": "Add", "inbound_nodes": [[["activation_5", 0, 0, {}], ["add_1", 0, 0, {}]]], "config": {"trainable": true, "name": "add_2"}, "name": "add_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResCnn.layer_3_cv_a", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "ResCnn.layer_3_cv_a"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["ResCnn.layer_3_cv_a", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResCnn.layer_3_bn_a", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "ResCnn.layer_3_bn_a"}, {"class_name": "Activation", "inbound_nodes": [[["ResCnn.layer_3_bn_a", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "name": "activation_6"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResCnn.layer_3_cv_b", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "ResCnn.layer_3_cv_b"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["ResCnn.layer_3_cv_b", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResCnn.layer_3_bn_b", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "ResCnn.layer_3_bn_b"}, {"class_name": "Activation", "inbound_nodes": [[["ResCnn.layer_3_bn_b", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "name": "activation_7"}, {"class_name": "Add", "inbound_nodes": [[["activation_7", 0, 0, {}], ["add_2", 0, 0, {}]]], "config": {"trainable": true, "name": "add_3"}, "name": "add_3"}], "input_layers": [["input_2", 0, 0]], "name": "resNet", "output_layers": [["add_3", 0, 0]]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "resNet"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "WinRate.conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["resNet", 1, 0, {}]]], "name": "WinRate.conv"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "WinRate.bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["WinRate.conv", 0, 0, {}]]], "name": "WinRate.bn"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "MoveRate.conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["resNet", 1, 0, {}]]], "name": "MoveRate.conv"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "inbound_nodes": [[["WinRate.bn", 0, 0, {}]]], "name": "activation_9"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "MoveRate.bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 3, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["MoveRate.conv", 0, 0, {}]]], "name": "MoveRate.bn"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}, "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "flatten_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "inbound_nodes": [[["MoveRate.bn", 0, 0, {}]]], "name": "activation_8"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "WinRate.dense", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "name": "WinRate.dense"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "WinRate.gen", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["WinRate.dense", 0, 0, {}]]], "name": "WinRate.gen"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "MoveRate.gen", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 225, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "MoveRate.gen"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["WinRate.gen", 0, 0], ["MoveRate.gen", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}